/*
 *  Rewrite of AIX metrics using libperfstat API
 *
 *  Libperfstat can deal with a 32-bit and a 64-bit Kernel and does not require root authority.
 *
 *  The code is tested with AIX 5.2 (32Bit- and 64Bit-Kernel), but 5.1 and 5.3 shoud be OK too
 *
 *  by Andreas Schoenfeld, TU Darmstadt, Germany (4/2005) 
 *  E-Mail: Schoenfeld@hrz.tu-darmstadt.de
 *
 *  Its based on the 
 *  First stab at support for metrics in AIX
 *  by Preston Smith <psmith@physics.purdue.edu>
 *  Wed Feb 27 14:55:33 EST 2002
 *
 *  AIX V5 support, bugfixes added by Davide Tacchella <tack@cscs.ch>
 *  May 10, 2002
 *
 *  you may still find some code (like "int bos_level(..)"  ) and the basic structure of this version. 
 *
 *  Some code fragments of the network statistics are "borowed" from  
 *  the Solaris Metrics   
 *
 *  Fix proc_total, proc_run, swap_free and swap_total. Implement mem_cached (MKN, 16-Jan-2006)
 *  Michael Perzl (michael@perzl.org), Mon, Jun 10 2013
 *  - Revisited the CPU statistics completely similar to the following example:
 *    http://pic.dhe.ibm.com/infocenter/aix/v6r1/index.jsp?topic=%2Fcom.ibm.aix.prftools%2Fdoc%2Fprftools%2Fidprftools_perfstat_glob_cpu.htm
 *  - Added a 'physc' and 'entc' field to the CPU statistics
 *  - If you define "-DDONATE_ENABLED" you need to compile on AIX 5.3 TL 06 or higher
 *
 *  Michael Perzl (michael@perzl.org), Thu, Oct 13 2011
 *  - Rewrote the CPU statistics completely similar to the following example:
 *    http://pic.dhe.ibm.com/infocenter/aix/v6r1/index.jsp?topic=%2Fcom.ibm.aix.prftools%2Fdoc%2Fprftools%2Fidprftools_perfstat_glob_cpu.htm
 *    If you define "-DDONATE_ENABLED" you need to compile on AIX 5.3 TL 06 or higher
 *  - Rewrote the "machine_type_func()" function
 */

#include <stdlib.h>
#include <utmp.h>
#include <stdio.h>
#include <procinfo.h>
#include <strings.h>
#include <signal.h>
#include <odmi.h>
#include <cf.h>
#include <sys/utsname.h>
#include <sys/proc.h>
#include <sys/types.h>
#include <time.h>

#include <libperfstat.h>
#include <sys/systemcfg.h>

#include "libmetrics.h"

/* order of includes must be changed or definition of 'malloc' as 'rpl_malloc' */
/* will interfere */
#include "interface.h"


struct Class *My_CLASS;

struct product
{
        char filler[12];
        char lpp_name[145];      /* offset: 0xc ( 12) */
        char comp_id[20];        /* offset: 0x9d ( 157) */
        short update;            /* offset: 0xb2 ( 178) */
        long cp_flag;            /* offset: 0xb4 ( 180) */
        char fesn[10];           /* offset: 0xb8 ( 184) */
        char *name;              /*[42] offset: 0xc4 ( 196) */
        short state;             /* offset: 0xc8 ( 200) */
        short ver;               /* offset: 0xca ( 202) */
        short rel;               /* offset: 0xcc ( 204) */
        short mod;               /* offset: 0xce ( 206) */
        short fix;               /* offset: 0xd0 ( 208) */
        char ptf[10];            /* offset: 0xd2 ( 210) */
        short media;             /* offset: 0xdc ( 220) */
        char sceded_by[10];      /* offset: 0xde ( 222) */
        char *fixinfo;           /* [1024] offset: 0xe8 ( 232) */
        char *prereq;            /* [1024] offset: 0xec ( 236) */
        char *description;       /* [1024] offset: 0xf0 ( 240) */
        char *supersedes;        /* [512] offset: 0xf4 ( 244) */
};

#if defined(_AIX43)
#ifndef SBITS
/*
 * For multiplication of fractions that are stored as integers, including
 * p_pctcpu.  Not allowed to do floating point arithmetic in the kernel.
 */
#define SBITS   16
#endif
#endif

#define MAX_CPUS  64

#define INFO_TIMEOUT   10
#define CPU_INFO_TIMEOUT INFO_TIMEOUT

#define MEM_KB_PER_PAGE (4096/1024)


/* values for the implementation field for POWER_PC architectures */

#ifndef POWER_4
#define POWER_4         0x0800          /* 4 class CPU */
#endif
#ifndef POWER_5
#define POWER_5         0x2000          /* 5 class CPU */
#endif
#ifndef POWER_6
#define POWER_6         0x4000          /* 6 class CPU */
#endif
